Revit 2027 API
AreaBasedLoadData.CanConnectToUpstreamNode Method
 Verifies that the area based load can connect to the upstream electrical analytical node. If the area based load already has an upstream node or the upstream node is full of downstream nodes, the area based load can't connect to the upstream node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanConnectToUpstreamNode(
	ElementId upstreamNodeId
)
Public Function CanConnectToUpstreamNode (
	upstreamNodeId As ElementId
) As Boolean
public:
bool CanConnectToUpstreamNode(
	ElementId^ upstreamNodeId
)
member CanConnectToUpstreamNode :
        upstreamNodeId : ElementId -> bool
Parameters
upstreamNodeId ElementId
 The upstream electrical analytical node id.
Return Value
Boolean
 True if the area based load can connect to the upstream electrical analytical node.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 If the area based load supplies from Node A, Node A is the upstream node of the area based load, and the area based load is the downstream node of node A.
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace